app/controllers/posts_controller.rb

	def create
	#	@post = Post.new
	#the above line is changed to have strong params
		@post = Post.new(params.permit(:title, :description))
	  @post.title = params[:title]
	  @post.description = params[:description]
	  @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2015-12-31 19:45:52.559860"], ["updated_at", "2015-12-31 19:45:52.559860"]]

	def update

	  @post = Post.find(params[:id])
		#the below line is changed to make the form_for
		#form_for is bound directly with th epost model--so we need to pass the model name into the udapte method
		#@post.update(title: params[:title], description: params[:description])
		#@post.update(params.require(:post))
		@post.update(params.require(:post).permit(:title))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "My edit"], ["description", "My post description"], ["updated_at", "2015-12-31 20:39:10.987245"], ["id", 1]]